2D_syngas_premixed/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 4e5;

boundaryField
{
    patch0_half0
    {
        type            empty;
    }
    patch0_half1
    {
        type            empty;
    }
    patch1_half0
    {
        type            waveTransmissive;
        field           p;
		pis             thermo:psi;
		gamma           1.4;
		fieldInf        4e5;
		lInf            1;
		value           $internalField;
    }
    patch1_half1
    {
        type            waveTransmissive;
        field           p;
		pis             thermo:psi;
		gamma           1.4;
		fieldInf        4e5;
		lInf            1;
		value           $internalField;
    }
    patch2_half0
    {
        type            waveTransmissive;
        field           p;
		pis             thermo:psi;
		gamma           1.4;
		fieldInf        4e5;
		lInf            1;
		value           $internalField;
    }
    patch2_half1
    {
        type            waveTransmissive;
        field           p;
		pis             thermo:psi;
		gamma           1.4;
		fieldInf        4e5;
		lInf            1;
		value           $internalField;
    }
}


// ************************************************************************* //
