2D_syngas_premixed/0.org/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    patch0_half0
    {
        type            empty;
    }
    patch0_half1
    {
        type            empty;
    }
    patch1_half0
    {
        type            zeroGradient;
    }
    patch1_half1
    {
        type            zeroGradient;
    }
    patch2_half0
    {
        type            zeroGradient;
    }
    patch2_half1
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
